Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: While variadic functions can accept a variable number of parameters, an array of parameters can be passed to any function by applying the same syntax to a function-call:
ja: 可変型関数は可変数のパラメータを受け取ることができますが、関数呼び出しに同じ構文を適用することで、パラメータの配列を任意の関数に渡すことができます：

source: White
ja: White（白）

source: Whitespace and parentheses are fully handled when the expression is pre-compiled and therefore do not affect this optimization.
ja: 空白と括弧は、式がプリコンパイルされるときに完全に処理されるため、この最適化に影響しません。

source: Whitespace characters such as spaces and tabs will be preserved unless those characters are included in the Delimiters or OmitChars parameters.
ja: スペースやタブなどの空白文字は、DelimitersまたはOmitCharsパラメータにそれらの文字が含まれていない限り保持されます。

source: Whitespace inside the braces is not permitted (except as a flag).
ja: 中括弧の中の空白は許されない（フラグとして除く）。

source: Why are the non-ASCII characters in my script displaying or sending incorrectly?
ja: スクリプトの非ASCII文字が正しく表示されない、または送信できないのはなぜですか？

source: Why do Hotstrings, Send, and Click have no effect in certain games?
ja: 特定のゲームにおいて、「Hotstrings」「Send」「Click」の効果がないのはなぜですか？

source: Why doesn't my script work on Windows xxx even though it worked on a previous version?
ja: 以前のバージョンでは動作していたのに、Windowsxxxでは私のスクリプトが動作しないのはなぜですか？

source: Why don't Hotstrings, Send, and Click work in certain games?
ja: 特定のゲームでホットストリング、Send関数、Click関数が動作しないのはなぜですか？

source: Why don't Hotstrings, Send, and MouseClick work in certain games?
ja: 特定のゲームでHotstrings、Send、MouseClickが機能しないのはなぜですか？

source: Why is the Run function unable to launch my game or program?
ja: 実行機能でゲームやプログラムを起動できないのはなぜですか？

source: Width (in pixels) of the left and right edges and the height of the top and bottom edges of a control's focus rectangle.
ja: コントロールのフォーカス矩形の左右の辺の幅と上下の辺の高さ（ピクセル単位）。

source: Width := A_ScreenWidth - 28 ; Minus 28 to allow room for borders and margins inside.
ja: Width := A_ScreenWidth - 28 ; 内側にボーダーや余白のスペースを確保するため、28をマイナスします。

source: Width and height of a button in a window's caption or title bar, in pixels.
ja: ウィンドウのキャプションまたはタイトルバーにあるボタンの幅と高さをピクセル単位で指定する。

source: Width and height of a cursor, in pixels.
ja: カーソルの幅と高さをピクセル単位で示す。

source: Width and height of a rectangle centered on a drag point to allow for limited movement of the mouse pointer before a drag operation begins.
ja: ドラッグ操作を開始する前にマウスポインタの移動を制限できるようにするための、ドラッグポイントを中心とした矩形の幅と高さ。

source: Width and height of a window border, in pixels.
ja: ウィンドウの境界線の幅と高さをピクセル単位で指定する。

source: Width and height of the client area for a full-screen window on the primary display monitor, in pixels.
ja: プライマリディスプレイモニタ上のフルスクリーンウィンドウのクライアント領域の幅と高さをピクセル単位で示す。

source: Width and height of the rectangle around the location of a first click in a double-click sequence, in pixels.
ja: ダブルクリックシーケンスの最初のクリック位置を囲む矩形の幅と高さ（ピクセル単位）。

source: Width and height of the screen of the primary display monitor, in pixels.
ja: プライマリディスプレイモニターの画面の幅と高さをピクセル単位で示す。

source: Width and height of the virtual screen, in pixels.
ja: 仮想スクリーンの幅と高さ（ピクセル単位）。

source: Width and height to which to scale the image (this width and height also determines which icon to load from a multi-icon .ICO file).
ja: 画像を拡大縮小する幅と高さ（この幅と高さは、マルチアイコン.ICOファイルからどのアイコンを読み込むかも決定）。

source: Width is the horizontal distance between the left and right side of the client area, and height the vertical distance between the top and bottom side (in pixels).
ja: widthはクライアントエリアの左右の水平距離、heightは上下の垂直距離です（単位：ピクセル）。

source: Width is the horizontal distance between the left and right side of the window, and height the vertical distance between the top and bottom side (in pixels).
ja: widthはウィンドウの左右の水平距離、heightは上下の垂直距離です（単位：ピクセル）。

source: Width of a vertical scroll bar, in pixels; and height of the arrow bitmap on a vertical scroll bar, in pixels.
ja: 縦スクロールバーの幅をピクセル単位で、縦スクロールバーの矢印ビットマップの高さをピクセル単位で指定する。

source: Width of rectangle or ellipse.
ja: 矩形または楕円の幅。

source: Width of the arrow bitmap on a horizontal scroll bar, in pixels; and height of a horizontal scroll bar, in pixels.
ja: 水平スクロールバーの矢印ビットマップの幅をピクセル単位で、水平スクロールバーの高さをピクセル単位で指定する。

source: Width of the thumb box in a horizontal scroll bar, in pixels.
ja: 横スクロールバーのサムボックスの幅をピクセル単位で示す。

source: Width, in pixels.
ja: 幅をピクセル単位で指定します。

source: Wildcard hotkeys always use the keyboard hook, as do any hotkeys eclipsed by a wildcard hotkey.
ja: ワイルドカードホットキーは、ワイルドカードホットキーに取って代わられたホットキーと同様に、常にキーボードフックを使用します。

source: Wildcard:
ja: ワイルドカード：

source: Wildcard: Fire the hotkey even if extra modifiers are being held down.
ja: ワイルドカード：余分なモディファイアが押されていても、ホットキーを発射します。

source: Wildcards (* and ?) and other characters illegal in filenames are treated the same as legal characters, with the exception of colon, backslash, and period (dot), which are processed according to their nature in delimiting the drive letter, directory, and extension of the file.
ja: コロン、バックスラッシュ、ピリオド(ドット)を除き、ワイルドカード(*と?)およびファイル名で不正なその他の文字は、正規の文字と同様に扱われ、ファイルのドライブ文字、ディレクトリ、および拡張子を区切る際の性質に従って処理されます。

source: Wildcards are supported.
ja: ワイルドカードに対応しています。

source: Win Functions
ja: Win関数

source: Win32 Menus
ja: Win32メニュー

source: WinActivate ; Activate the window found above
ja: WinActivate ; 上記のウィンドウをアクティブにします。

source: WinActivate ; Activate the window found by the above function.
ja: WinActivate ; 上の関数で見つかったウィンドウをアクティブにします。

source: WinActivate "ahk_pid " PID ; Show the result.
ja: WinActivate "ahk_pid " PID ; 結果を表示します。

source: WinActivate - Syntax & Usage | AutoHotkey v2
ja: WinActivate - 構文と使用法｜AutoHotkey v2

source: WinActivate ; Use the window found by WinExist.
ja: WinActivate ; WinExistで見つかったウィンドウを使用します。

source: WinActivate ; Use the window found by WinWait.
ja: WinActivate ; WinWait関数で見つかったウィンドウが対象となります。

source: WinActivateBottom - Syntax & Usage | AutoHotkey v2
ja: WinActivateBottom - 構文と使用法｜AutoHotkey v2

source: WinActive - Syntax & Usage | AutoHotkey v2
ja: WinActive - 構文と使用法｜AutoHotkey v2

source: WinClose ; Close the window found by WinWaitClose.
ja: WinClose ; WinWaitClose関数で見つかったウィンドウを閉じます。

source: WinClose "ScriptFileName.ahk - AutoHotkey" ; Update this to reflect the script's name (case sensitive).
ja: WinClose "ScriptFileName.ahk - AutoHotkey" ; スクリプトの名前（大文字と小文字が区別されます）を反映するように更新します。

source: WinClose "ScriptFileName.ahk - AutoHotkey" ; Update this to reflect the script's name (case-sensitive).
ja: WinClose "ScriptFileName.ahk - AutoHotkey" ; スクリプト名の大文字小文字問題を回避するためアップデート

source: WinClose - Syntax & Usage | AutoHotkey v2
ja: WinClose - 構文と使用法｜AutoHotkey v2

source: WinClose ; Use the window found by WinActive.
ja: WinClose ; WinActive関数で見つかったウィンドウが対象になります。

source: WinClose ; Use the window found by WinExist.
ja: WinClose ; WinExist関数で見つかったウィンドウが対象です。

source: WinClose sends a WM_CLOSE message to the target window, which is a somewhat forceful method of closing it.
ja: WinCloseはターゲット・ウィンドウにWM_CLOSEメッセージを送ります。

source: WinExist "A" ; Make the active window the Last Found Window
ja: WinExist "A" ; アクティブウィンドウをLast Found Windowにします。

source: WinExist - Syntax & Usage | AutoHotkey v2
ja: WinExist - 構文と使用法｜AutoHotkey v2

source: WinExist("A") ; Set the Last Found Window to the active window
ja: WinExist("A") ; Last Found Windowをアクティブウィンドウに設定します。

source: WinGetClass - Syntax & Usage | AutoHotkey v2
ja: WinGetClass - 構文と使用法｜AutoHotkey v2

source: WinGetClientPos &Xpos, &Ypos ; Use the window found by WinExist.
ja: WinGetClientPos &Xpos, &Ypos ; WinExist関数で見つかったウィンドウを使用します。

source: WinGetClientPos - Syntax & Usage | AutoHotkey v2
ja: WinGetClientPos - 構文と使用法｜AutoHotkey v2

source: WinGetControls - Syntax & Usage | AutoHotkey v2
ja: WinGetControls - 構文と使用法｜AutoHotkey v2

source: WinGetControlsHwnd - Syntax & Usage | AutoHotkey v2
ja: WinGetControlsHwnd - 構文と使用法｜AutoHotkey v2

source: WinGetCount - Syntax & Usage | AutoHotkey v2
ja: WinGetCount - 構文と使用法｜AutoHotkey v2

source: WinGetID - Syntax & Usage | AutoHotkey v2
ja: WinGetID - 構文と使用法｜AutoHotkey v2

source: WinGetIDLast - Syntax & Usage | AutoHotkey v2
ja: WinGetIDLast - 構文と使用法｜AutoHotkey v2

source: WinGetList - Syntax & Usage | AutoHotkey v2
ja: WinGetList - 構文と使用法｜AutoHotkey v2

source: WinGetMinMax - Syntax & Usage | AutoHotkey v2
ja: WinGetMinMax - 構文と使用法｜AutoHotkey v2

source: WinGetPID - Syntax & Usage | AutoHotkey v2
ja: WinGetPID - 構文と使用法｜AutoHotkey v2

source: WinGetPos &Xpos, &Ypos ; Use the window found by WinExist.
ja: WinGetPos &Xpos, &Ypos ; WinExist関数で見つかったウィンドウが使用されます。

source: WinGetPos - Syntax & Usage | AutoHotkey v2
ja: WinGetPos - 構文と使用法｜AutoHotkey v2

source: WinGetPos stores the current position in current_x and current_y, which we then add to x and y.
ja: WinGetPosは現在の位置をcurrent_xと current_yに格納し、それをxと yに加算しています。

source: WinGetProcessName - Syntax & Usage | AutoHotkey v2
ja: WinGetProcessName - 構文と使用法｜AutoHotkey v2

source: WinGetProcessPath - Syntax & Usage | AutoHotkey v2
ja: WinGetProcessPath - 構文と使用法｜AutoHotkey v2

source: WinGetStyle / WinGetExStyle - Syntax & Usage | AutoHotkey v2
ja: WinGetStyle / WinGetExStyle - 構文と使用法｜AutoHotkey v2

source: WinGetText - Syntax & Usage | AutoHotkey v2
ja: WinGetText - 構文と使用法｜AutoHotkey v2

source: WinGetTitle - Syntax & Usage | AutoHotkey v2
ja: WinGetTitle - 構文と使用法｜AutoHotkey v2

source: WinGetTransColor - Syntax & Usage | AutoHotkey v2
ja: WinGetTransColor - 構文と使用法｜AutoHotkey v2

source: WinGetTransparent - Syntax & Usage | AutoHotkey v2
ja: WinGetTransparent - 構文と使用法｜AutoHotkey v2

source: WinHide - Syntax & Usage | AutoHotkey v2
ja: WinHide - 構文と使用法｜AutoHotkey v2

source: WinHide ; Use the window found by WinWait.
ja: WinHide ; WinWait関数で見つかったウィンドウが対象となります。

source: WinKill - Syntax & Usage | AutoHotkey v2
ja: WinKill - 構文と使用法｜AutoHotkey v2

source: WinKill ; Use the window found by WinExist.
ja: WinKill ; WinExistで見つかったウィンドウを使用します。

source: WinMaximize - Syntax & Usage | AutoHotkey v2
ja: WinMaximize - 構文と使用法｜AutoHotkey v2

source: WinMaximize ; Use the window found by WinWait.
ja: WinMaximize ; WinWait関数で見つかったウィンドウが対象となります。

source: WinMinimize - Syntax & Usage | AutoHotkey v2
ja: WinMinimize - 構文と使用法｜AutoHotkey v2

source: WinMinimize ; Use the window found by WinWait.
ja: WinMinimize ; WinWait関数で見つかったウィンドウが対象となります。

source: WinMinimize ; Use the window found by WinWaitActive.
ja: WinMinimize ; WinWaitActive関数で見つかったウィンドウが対象となります。

source: WinMinimize minimizes the window using a direct method, bypassing the window message which is usually sent when the minimize button, window menu or taskbar is used to minimize the window.
ja: WinMinimizeは、最小化ボタン、ウィンドウメニュー、またはタスクバーを使用してウィンドウを最小化するときに通常送信されるウィンドウメッセージをバイパスして、直接的な方法を使用してウィンドウを最小化します。

source: WinMinimizeAll / WinMinimizeAllUndo - Syntax & Usage | AutoHotkey v2
ja: WinMinimizeAll / WinMinimizeAllUndo - 構文と使用法｜AutoHotkey v2

source: WinMove - Syntax & Usage | AutoHotkey v2
ja: WinMove - 構文と使用法｜AutoHotkey v2

source: WinMove 0, 0 ; Use the window found by WinWait.
ja: WinMove 0, 0 ; WinWait関数で見つかったウィンドウが対象となります。

source: WinMoveBottom - Syntax & Usage | AutoHotkey v2
ja: WinMoveBottom - 構文と使用法｜AutoHotkey v2

source: WinMoveTop - Syntax & Usage | AutoHotkey v2
ja: WinMoveTop - 構文と使用法｜AutoHotkey v2

source: WinRedraw - Syntax & Usage | AutoHotkey v2
ja: WinRedraw - 構文と使用法｜AutoHotkey v2

source: WinRestore - Syntax & Usage | AutoHotkey v2
ja: WinRestore - 構文と使用法｜AutoHotkey v2

source: WinSetAlwaysOnTop - Syntax & Usage | AutoHotkey v2
ja: WinSetAlwaysOnTop - 構文と使用法｜AutoHotkey v2

source: WinSetEnabled - Syntax & Usage | AutoHotkey v2
ja: WinSetEnabled - 構文と使用法｜AutoHotkey v2

source: WinSetRegion - Syntax & Usage | AutoHotkey v2
ja: WinSetRegion - 構文と使用法｜AutoHotkey v2

source: WinSetStyle / WinSetExStyle - Syntax & Usage | AutoHotkey v2
ja: WinSetStyle / WinSetExStyle - 構文と使用法｜AutoHotkey v2

source: WinSetTitle "This is a new title" ; Use the window found by WinWaitActive.
ja: WinSetTitle "This is a new title" ; WinWaitActive関数で見つかったウィンドウが対象です。

source: WinSetTitle - Syntax & Usage | AutoHotkey v2
ja: WinSetTitle - 構文と使用法｜AutoHotkey v2

source: WinSetTransColor - Syntax & Usage | AutoHotkey v2
ja: WinSetTransColor - 構文と使用法｜AutoHotkey v2

source: WinSetTransparent - Syntax & Usage | AutoHotkey v2
ja: WinSetTransparent - 構文と使用法｜AutoHotkey v2

source: WinShow - Syntax & Usage | AutoHotkey v2
ja: WinShow - 構文と使用法｜AutoHotkey v2

source: WinShow ; Use the window found by WinWait.
ja: WinShow ; WinWait関数で見つかったウィンドウを表示します。

source: WinTitle & Last Found Window | AutoHotkey v2
ja: WinTitleと最後に表示されたウィンドウ｜AutoHotkey v2

source: WinWait "Untitled - Notepad" ; This also sets the "last found window" for use with WinExist below.
ja: WinWait "無題-メモ帳" ; これは、以下のWinExistで使用するための「ラストファウンドウィンドウ」も設定します。

source: WinWait "Untitled - Notpad" ; (intentional typo)
ja: WinWait "Untitled - Notpad" ; （意図的な誤字）

source: WinWait "ahk_pid " PID ; Wait for it to appear.
ja: WinWait "ahk_pid " PID ; 表示されるのを待ちます。

source: WinWait - Syntax & Usage | AutoHotkey v2
ja: WinWait - 構文と使用法｜AutoHotkey v2

source: WinWait and WinWaitActive return the HWND of the found window.
ja: WinWait、WinWaitActiveは、見つかったウィンドウのHWNDを返します。

source: WinWait's result is actually the ID of the window (as described above) or zero if it timed out.
ja: WinWaitの結果は、実際にはウィンドウのID（上記の通り）か、タイムアウトした場合はゼロになります。

source: WinWaitActive "ahk_class #32770" ; Wait for the dialog to appear.
ja: WinWaitActive "ahk_class #32770" ; ダイアログが表示されるのを待ちます。

source: WinWaitActive / WinWaitNotActive - Syntax & Usage | AutoHotkey v2
ja: WinWaitActive / WinWaitNotActive - 構文と使用法｜AutoHotkey v2

source: WinWaitActive returns the HWND (unique ID) of the active window if it matches the criteria, or 0 if the function timed out.
ja: WinWaitActiveは、条件にマッチすればアクティブなウィンドウのHWND（ユニークID）を返し、関数がタイムアウトしたときは0を返します。

source: WinWaitClose - Syntax & Usage | AutoHotkey v2
ja: WinWaitClose - 構文と使用法｜AutoHotkey v2

source: WinWaitClose ; Use the window found by WinWait.
ja: WinWaitClose ; WinWait関数で見つかったウィンドウを使います。

source: WinWaitClose now sets the Last Found Window, so if WinWaitClose times out, it returns 0 (false) and WinExist() returns the last window it found.
ja: WinWaitCloseがLast Found Windowを設定するようになったので、WinWaitCloseがタイムアウトした場合は0 (false)を返し、WinExist()は最後に見つかったウィンドウを返すようになりました。

source: WinWaitClose now sets the Last Found Window, so if WinWaitClose times out, it returns false and WinExist() returns the last window it found.
ja: WinWaitCloseがLast Found Windowを設定するようになったので、WinWaitCloseがタイムアウトした場合はfalseを返し、WinExist()は最後に見つかったウィンドウを返すようになりました。

source: WinWaitClose updates the Last Found Window whenever it finds a matching window.
ja: WinWaitCloseは、一致するウィンドウが見つかるたびに、最後に見つかったウィンドウを更新します。

source: WinWaitNotActive returns 1 (true) if the active window does not match the criteria, or 0 (false) if the function timed out.
ja: WinWaitNotActiveは、アクティブなウィンドウが条件に一致しないときは1を返し、関数がタイムアウトしたときは0を返します。

source: WinWaitNotActive returns 1 if the active window does not match the criteria, or 0 if the function timed out.
ja: WinWaitNotActiveは、アクティブなウィンドウが条件に一致しないときは1を返し、関数がタイムアウトしたときは0を返します。

source: Window Appearance
ja: ウィンドウの外観

source: Window Class
ja: ウィンドウズクラス

source: Window Group
ja: 窓グループ

source: Window Groups
ja: ウィンドウズ・グループ

source: Window ID (HWND)
ja: ウインドウID（HWND）

source: Window Shading
ja: Windowのシェーディング

source: Window Spy - Displays various information about a window.
ja: Window Spy - ウィンドウに関する様々な情報を表示します。

source: Window Spy has an option for Slow TitleMatchMode so that its easy to determine whether the slow mode is needed.
ja: Window SpyにはSlow TitleMatchModeのオプションがあり、スローモードが必要かどうかを簡単に判断できます。

source: Window and Control Styles
ja: ウィンドウとコントロールのスタイル

source: Window and Control Styles | AutoHotkey v2
ja: ウィンドウとコントロールのスタイル｜AutoHotkey v2

source: Window specific hotkeys/hotstrings
ja: ウィンドウ固有のホットキー/ホットストリング

source: Window titles and text are case sensitive.
ja: ウィンドウのタイトルとテキストは大文字と小文字が区別されます。

source: Window titles and text are case-sensitive.
ja: ウィンドウのタイトルとテキストは大文字と小文字を区別します。

source: Window titles are always case-sensitive, except when using the RegEx matching mode with the i) modifier.
ja: ウィンドウのタイトルは、i)修飾子によるRegExマッチングモードを使用する場合を除き、常に大文字と小文字が区別されます。

source: Window titles are case-sensitive, except when using the i) modifier in a RegEx pattern.
ja: RegExパターンでi)修飾子を使用する場合を除き、ウィンドウタイトルは大文字と小文字を区別する。

source: WindowProcNew := CallbackCreate(WindowProc) ; Avoid fast-mode for subclassing.
ja: WindowProcNew := CallbackCreate(WindowProc) ; サブクラス作成時のfast-modeは避けてください。

source: WindowProcOld := DllCall(SetWindowLong, "Ptr", MyGui.Hwnd, "Int", -4 ; -4 is GWL_WNDPROC
ja: WindowProcOld := DllCall(SetWindowLong, "Ptr", MyGui.Hwnd, "Int", -4 ; -4 は GWL_WNDPROC

source: Windows 2000 and Windows XP support has been dropped.
ja: Windows 2000とWindows XPのサポートは終了しました。

source: Windows Constant
ja: ウィンドウズ定数

source: Windows Explorer ignores SendInput's simulation of certain navigational hotkeys such as Alt+←.
ja: Windows Explorerでは、Alt+←などの特定のナビゲーションホットキーのSendInputのシミュレーションが無視されます。

source: Windows Messages
ja: Windowsメッセージ

source: Windows Messages | AutoHotkey v2
ja: Windowsメッセージ｜AutoHotkey v2

source: Windows are retrieved in order from topmost to bottommost (according to how they are stacked on the desktop).
ja: ウィンドウは、（デスクトップ上の積み重ね方に従って）最上位から最下位へと順番に検索される。

source: Windows can be identified by the process which created them by using the word "ahk_exe" followed by the name or path of the process.
ja: Windowsは、「ahk_exe」という単語の後にプロセスの名前またはパスを付けることで、それを作成したプロセスによって識別することができます。

source: Windows provides a set of functions and notifications for creating, modifying and displaying menus with standard appearance and behavior.
ja: Windowsは、標準的な外観と動作を持つメニューを作成、変更、表示するための一連の関数と通知を提供します。

source: Windows whose text include this value will not be considered.
ja: テキストにこの値が含まれているウィンドウは、検討の対象外となります。

source: Windows whose title or text contains ExcludeTitle or ExcludeText will not be considered.
ja: タイトルまたはテキストにExcludeTitleまたはExcludeTextが含まれているウィンドウは考慮されません。

source: Windows whose titles include this value will not be considered.
ja: タイトルにこの値が含まれているWindowsは、審査対象外となります。

source: Windows with WS_EX_TOOLWINDOW but not WS_EX_APPWINDOW are omitted from the taskbar and Alt-Tab, and are therefore skipped.
ja: WS_EX_TOOLWINDOW を持ち、WS_EX_APPWINDOW を持たないウィンドウは、タスクバーと Alt-Tab から省略され、スキップされます。

source: Windows with the WS_EX_NOACTIVATE style are skipped, since they are probably not supposed to be activated.
ja: WS_EX_NOACTIVATE スタイルを持つウィンドウは、おそらくアクティベートされることを想定していないため、スキップされます。

source: Windows with the WS_EX_TOOLWINDOW style but without the WS_EX_APPWINDOW style are skipped.
ja: WS_EX_TOOLWINDOW スタイルを持ち、WS_EX_APPWINDOW スタイルを持たないウィンドウはスキップされます。

source: Windows with the WS_EX_TOPMOST or WS_EX_NOACTIVATE styles are skipped.
ja: WS_EX_TOPMOST または WS_EX_NOACTIVATE スタイルを持つウィンドウはスキップされます。

source: Winspector Spy (can be found here)
ja: ウィンスペクター・スパイ（ここにある）

source: With Cdecl or the 64-bit calling convention, ParamCount has no effect.
ja: Cdeclまたは64ビット呼び出し規約では、ParamCountは何の効果もない。

source: With AutoHotkey installed, there are several ways to run a script:
ja: AutoHotkeyをインストールすると、スクリプトを実行する方法がいくつかあります：

source: With Delphi apps... the GUI of some apps doesn't even use wm_command.
ja: Delphiアプリでは...いくつかのアプリのGUIはwm_commandすら使わない。

source: With Internet Explorer, perhaps the most reliable method is to use DllCall and COM as demonstrated at www.autohotkey.com/forum/topic19256.html.
ja: Internet Explorerの場合、おそらく最も確実な方法は、www.autohotkey.com/forum/topic19256.htmlで示したように、DllCallとCOMを使用することです。

source: With VB apps the 'LParam' of the same function keeps changing from one run to another.
ja: VBアプリでは、同じ関数の'LParam'が実行ごとに変わり続ける。

source: With few exceptions, this is similar to the built-in variable A_ThisHotkey.
ja: 一部の例外を除き、組み込み変数A_ThisHotkeyと同様です。

source: With syntax highlighting, words, symbols and segments of code are colour-coded to indicate their meaning.
ja: シンタックス・ハイライトでは、単語、記号、コードのセグメントが色分けされて意味を示す。

source: With the default icons, the color of the tray icon changes from green to red whenever the script's current thread is in a paused state.
ja: デフォルトのアイコンでは、スクリプトのカレントスレッドが一時停止状態にあるときは、トレイアイコンの色が緑から赤に変化します。

source: With the exception of ImageSearch, this forces the function to take a copy of the image.
ja: ImageSearchを除き、この関数は強制的に画像のコピーを取ります。

source: With the exception of IsFloat, IsInteger and IsNumber, an exception is thrown if the parameter is not a string, as implicit conversion to string may cause counter-intuitive results.
ja: IsFloat、IsInteger、IsNumberを除き、パラメータが文字列でない場合、暗黙のうちに文字列に変換すると直感的でない結果を引き起こす可能性があるため、例外がスローされます。

source: With the exception of isFloat, isInteger and isNumber, an exception is thrown if the parameter is not a string, as implicit conversion to string may cause counter-intuitive results.
ja: isFloat、isInteger、isNumberを除き、パラメータが文字列でない場合、暗黙のうちに文字列に変換すると直感的でない結果を引き起こす可能性があるため、例外がスローされます。

source: With the following hotkeys in effect, clicking the middle button displays the menu and turning the wheel navigates through it:
ja: 以下のホットキーが有効な場合、中央のボタンをクリックするとメニューが表示され、ホイールを回すとメニューの中を移動します：

source: With this form of hotkey, only the final key in the combination can be written literally as a single character or have its name spelled out in full.
ja: この形式のホットキーでは、組み合わせの最後のキーだけを1文字で書いたり、その名前をフルスペルで書いたりすることができます。

source: With this option enabled, `v/VT/vertical tab/chr(0xB), `f/FF/formfeed/chr(0xC), NEL/next-line/chr(0x85), LS/line separator/chr(0x2028) and PS/paragraph separator/chr(0x2029) are also recognized.
ja: このオプションを有効にすると、`v/VT/垂直タブ/chr(0xB)、`f/FF/formfeed/chr(0xC)、NEL/next-line/chr(0x85)、LS/line separator/chr(0x2028)、PS/paragraph separator/chr(0x2029) も認識される。

source: Within get or set, this refers to the object being invoked.
ja: getまたはsetの中では、thisは呼び出されるオブジェクトを指す。

source: Within set, value contains the value being assigned.
ja: セット内では、valueに代入される値が含まれる。

source: Within a function call, array literal or object literal, the keyword unset can be used to explicitly omit the parameter or value.
ja: 関数呼び出し、配列リテラル、オブジェクトリテラル内で、キーワードunsetを使用すると、パラメータまたは値を明示的に省略することができます。

source: Within a registry loop, RegDelete does not necessarily delete the current loop item.
ja: レジストリループ内では、RegDeleteは必ずしも現在のループ項目を削除するわけではありません。

source: Within a registry loop, RegDeleteKey does not necessarily delete the current loop item.
ja: レジストリループ内では、RegDeleteKeyは必ずしも現在のループ項目を削除するわけではありません。

source: Within a character class, characters do not need to be escaped except when they have special meaning inside a class; e.g. [\^a], [a\-b], [a\]], and [\\a].
ja: 文字クラス内では、クラス内で特別な意味を持つ場合を除いて文字をエスケープする必要はない、例：[\^a]、[a\-b]、[\a]]、[\\a]。

source: Within a regular expression, special characters such as tab and newline can be escaped with either an accent (`) or a backslash (\).
ja: 正規表現の中で、タブや改行などの特殊文字は、アクセント記号（`）またはバックスラッシュ（\）でエスケープすることができます。

source: Within a string (text value), the numeric character code and size (in bytes) of each character depends on the encoding of the string.
ja: 文字列（テキスト値）の中で、各文字の数値文字コードとサイズ（バイト数）は、文字列のエンコーディングに依存します。

source: Within an assume-local function, if a given name is not used in a declaration or as the target of a non-dynamic assignment or the reference (&) operator, it may resolve to an existing global variable.
ja: 想定ローカル関数内で、与えられた名前が宣言や非動的代入、参照（&）演算子のターゲットとして使用されていない場合、既存のグローバル変数に解決することがあります。

source: Within an expression, a ~= b can be used as shorthand for RegExMatch(a, b).
ja: 式の中で、a ~= bはRegExMatch(a, b)の略記として使うことができます。

source: Within an expression, the a ~= b can be used as shorthand for RegExMatch(a, b).
ja: 式の中で、a ~= bはRegExMatch(a, b)の略記として使うことができます。

source: Within an expression, a function call "evaluates to" the return value of the function.
ja: 式の中で、関数呼び出しは関数の戻り値に「評価」されます。

source: Within an expression, each variable reference is automatically resolved to its contents, unless it is the target of an assignment or the reference operator (&).
ja: 式中では、代入や 参照演算子（&）の対象でない限り、各変数参照はその内容に自動的に解決されます。

source: Within each row, each field (column) except the last will end with a tab character (`t).
ja: 各行の中で、最後を除く各フィールド（列）はタブ文字（`t）で終わります。
